<?php
// Task 1. Если переменная $a равна нулю,
// то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при $a, равном 1, 0, -3.

//$a = 1;
//$a = 0;
//$a = -3;
//
//if($a == 0){
//    echo 'Верно';
//}
//else{
//    echo 'Неверно';
//}

// Task 2. Если переменная $a больше нуля,
// то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при $a, равном 1, 0, -3.

//$a = 1;
//$a = 0;
//$a = -3;
//
//if($a > 0){
//    echo 'Верно';
//}
//else{
//    echo 'Неверно';
//}

// Task 3. Если переменная $a меньше нуля,
// то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при $a, равном 1, 0, -3.

//$a = 1;
//$a = 0;
//$a = -3;
//
//if($a < 0){
//    echo 'Верно';
//}
//else{
//    echo 'Неверно';
//}

// Task 4. 	Если переменная $a больше или равна нулю,
// то выведите 'Верно', иначе выведите 'Неверно'.
// Проверьте работу скрипта при $a, равном 1, 0, -3.

//$a = 1;
$a = 0;
//$a = -3;

if($a >= 0){
    echo 'Верно';
}
else{
    echo 'Неверно';
}

