<?php
//Задачі узяті за адресою:
//http://old.code.mu/tasks/php/base/osnovy-yazyka-php-dlya-novichkov.html;

//// Работа с переменными
// Task 1. Создайте переменную $a и присвойте ей значение 3.
// Выведите значение этой переменной на экран
//$a = 3;
//echo "$a";

// Task 2. Создайте переменные $a=10 и $b=2.
//Выведите на экран их сумму, разность,
// произведение и частное (результат деления).
//$a = 10;
//$b = 2;
//$sum = $a + $b;
//$diff = $a - $b;
//$mult = $a * $b;
//$div = $a / $b;
//$mod = $a % $b;
//
//echo "$sum <br>";
//echo "$diff <br>";
//echo "$mult <br>";
//echo "$div <br>";
//echo "$mod";

// Task 3. Создайте переменные $c=15 и $d=2.
// Просуммируйте их, а результат присвойте переменной $result.
// Выведите на экран значение переменной $result.
//$c = 15;
//$d = 2;
//$result = $c + $d;
//echo "$result";

// Task 4. Создайте переменные $a=10, $b=2 и $c=5.
// Выведите на экран их сумму.
//$a = 10;
//$b = 2;
//$c = 5;
//$sum = $a + $b + $c;
//echo "$sum";

// Task 5. Создайте переменные $a=17 и $b=10.
// Отнимите от $a переменную $b и результат присвойте переменной $c.
// Затем создайте переменную $d, присвойте ей значение 7.
// Сложите переменные $c и $d, а результат запишите в переменную $result.
// Выведите на экран значение переменной $result.
//$a = 17;
//$b = 10;
//$c = $a - $b;
//$d = 7;
//$result = $c + $d;
//echo "$result";

////Работа со строками
// Task 6. 	Создайте переменную $text и присвойте ей значение 'Привет, Мир!'.
// Выведите значение этой переменной на экран.
//$text = 'Привет, Мир!';
//echo "$text";

// Task 7. Создайте переменные $text1='Привет, ' и $text2='Мир!'.
// С помощью этих переменных и операции сложения строк
// выведите на экран фразу 'Привет, Мир!'.
//$text1 = '\'Привет, ';
//$text2 = 'Мир!\'';
//echo "$text1"."$text2";

// Task 8. 	Создайте переменную $name и присвойте ей ваше имя.
// Выведите на экран фразу 'Привет, %Имя%!'.
// Вместо %Имя% должно стоять ваше имя.

//$name = 'Дмитрий';
//echo "'Привет, $name!";

// Task 9.  Создайте переменную $age и присвойте ей ваш возраст.
// Выведите на экран 'Мне %Возраст% лет!'.
$age = 31;
echo "'Мне $age лет!'";
